Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.2 plan -input=false -refresh -out "/atlantis-data/repos/shwetaec12/eks-atlantis-poc/1/default/default.tfplan"' in '/atlantis-data/repos/shwetaec12/eks-atlantis-poc/1/default': exit status 1
module.s3_backend.aws_s3_bucket.this: Refreshing state... [id=poc-terraform-state-bucket-eucentral1]
module.s3_backend.aws_s3_bucket_public_access_block.this: Refreshing state... [id=poc-terraform-state-bucket-eucentral1]
module.iam.kubernetes_cluster_role.atlantis_rbac: Refreshing state... [id=atlantis-access]
module.iam.kubernetes_role_binding.aws_auth_manager_binding: Refreshing state... [id=kube-system/aws-auth-manager-binding]
module.iam.kubernetes_cluster_role_binding.atlantis_rbac_binding: Refreshing state... [id=atlantis-access-binding]
module.iam.kubernetes_role.aws_auth_manager: Refreshing state... [id=kube-system/aws-auth-manager]
module.iam.kubernetes_service_account.atlantis_sa: Refreshing state... [id=default/atlantis-new]
module.iam.aws_iam_openid_connect_provider.oidc: Refreshing state... [id=arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-074a782c97c969ffb]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-03688cb37ad2f3a46]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0391b77481898602e]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07fc89e129faf40d8]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ecabacc3a4a59fb6]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cb4e5d7045ae165d]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e47c23216c81219d]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08d8820dad8c03a67]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00841fc938eaf61e8]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08b33e0e56f4da51d]
module.iam.aws_iam_role.eks_admin: Refreshing state... [id=eks-admin]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-035ccf4089a63d7f6]
module.iam.aws_iam_role.node_group: Refreshing state... [id=eks-node-group]
module.iam.aws_iam_role.atlantis_irsa_role: Refreshing state... [id=atlantis-irsa-role]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b8df93e38aaf7748]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cb4e5d7045ae165d1080289494]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05e953ff7429b8ec1]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0600db754c5e75f9d]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09f35b7259c4eace3]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-042e2e8a2ab324af9]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-06dd4087091b17934]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ecabacc3a4a59fb61080289494]
module.eks.module.eks.data.aws_partition.current: Reading...
module.eks.module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/poc-eks-cluster/cluster]
module.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-05c5d84d0b3780d41]
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks.data.aws_iam_session_context.current: Reading...
module.eks.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0ac40bc37cf650b88]
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=poc-eks-cluster-cluster-20250615224556704300000003]
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=895976263444]
module.eks.module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1750043206376655301]
module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3437556191]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2133131378]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-950351232]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-316235783]
module.eks.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-4020570123]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2587904825]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1331182186]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1543767627]
module.eks.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-76383801]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2249874940]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3062285288]
module.iam.aws_iam_role_policy_attachment.eks_admin_attach: Refreshing state... [id=eks-admin-20250615224518660000000001]
module.iam.aws_iam_role_policy_attachment.node_group_cni: Refreshing state... [id=eks-node-group-20250615224406653400000002]
module.iam.aws_iam_role_policy_attachment.node_group_registry: Refreshing state... [id=eks-node-group-20250615224406656300000003]
module.iam.aws_iam_role_policy_attachment.node_group_worker: Refreshing state... [id=eks-node-group-20250615224406635000000001]
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20250615224556704300000004]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=poc-eks-cluster-cluster-20250615224556704300000003-20250615224557723500000008]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=poc-eks-cluster-cluster-20250615224556704300000003-20250615224557840300000009]
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3698153645]
module.eks.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=2bad14fa-6188-40bc-a39c-7ce04cff5c42]
module.iam.aws_iam_role_policy.atlantis_policy: Refreshing state... [id=atlantis-irsa-role:atlantis-iam-policy]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20250615224556704300000004-20250615224557518800000006]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20250615224556704300000004-20250615224557510700000005]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20250615224556704300000004-20250615224557666200000007]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.iam.data.aws_iam_policy_document.atlantis_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "atlantis_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:default:atlantis-new",
                ]
              + variable = "oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam.data.aws_iam_policy_document.eks_admin_assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_admin_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam.aws_iam_openid_connect_provider.oidc must be replaced
+/- resource "aws_iam_openid_connect_provider" "oidc" {
      ~ arn             = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0" -> (known after apply)
      ~ id              = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0" -> (known after apply)
      - tags            = {
          - "Environment" = "production"
          - "Name"        = "poc-eks-cluster-eks-irsa"
        } -> null
      ~ tags_all        = {
          - "Environment" = "production"
          - "Name"        = "poc-eks-cluster-eks-irsa"
        } -> (known after apply)
      ~ thumbprint_list = [
          ~ "06b25927c42a721631c1efd9431e648fa62e1e39" -> "9e99a48a9960b14926bb7f3b02e22da0cbed5e11",
        ]
      ~ url             = "oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0" -> "https://oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.iam.aws_iam_role.atlantis_irsa_role will be updated in-place
  ~ resource "aws_iam_role" "atlantis_irsa_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0:sub" = "system:serviceaccount:default:atlantis-new"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "atlantis-irsa-role"
        name                  = "atlantis-irsa-role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.iam.aws_iam_role.eks_admin will be updated in-place
  ~ resource "aws_iam_role" "eks_admin" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-admin"
        name                  = "eks-admin"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.iam.aws_iam_role.node_group will be updated in-place
  ~ resource "aws_iam_role" "node_group" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3D6565BE4A36E46750ECFA6BDDCC98C0"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-node-group"
        name                  = "eks-node-group"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.iam.kubernetes_service_account.atlantis_sa will be destroyed
  # (because kubernetes_service_account.atlantis_sa is not in configuration)
  - resource "kubernetes_service_account" "atlantis_sa" {
      - automount_service_account_token = true -> null
      - id                              = "default/atlantis-new" -> null
        # (1 unchanged attribute hidden)

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "atlantis-new" -> null
          - namespace        = "default" -> null
          - resource_version = "48647" -> null
          - uid              = "258b4246-7bb6-4258-975d-26679c013ecf" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 3 to change, 2 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.s3_backend.aws_s3_bucket.this,
│   on modules/s3-backend/main.tf line 1, in resource "aws_s3_bucket" "this":
│    1: resource "aws_s3_bucket" "this" {
│ 
│ versioning is deprecated. Use the aws_s3_bucket_versioning resource
│ instead.
│ 
│ (and 3 more similar warnings elsewhere)
╵
╷
│ Error: clusterroles.rbac.authorization.k8s.io "atlantis-access" is forbidden: User "system:serviceaccount:default:atlantis-new" cannot get resource "clusterroles" in API group "rbac.authorization.k8s.io" at the cluster scope
│ 
│ 
╵
╷
│ Error: rolebindings.rbac.authorization.k8s.io "aws-auth-manager-binding" is forbidden: User "system:serviceaccount:default:atlantis-new" cannot get resource "rolebindings" in API group "rbac.authorization.k8s.io" in the namespace "kube-system"
│ 
│ 
╵
╷
│ Error: clusterrolebindings.rbac.authorization.k8s.io "atlantis-access-binding" is forbidden: User "system:serviceaccount:default:atlantis-new" cannot get resource "clusterrolebindings" in API group "rbac.authorization.k8s.io" at the cluster scope
│ 
│ 
╵
╷
│ Error: roles.rbac.authorization.k8s.io "aws-auth-manager" is forbidden: User "system:serviceaccount:default:atlantis-new" cannot get resource "roles" in API group "rbac.authorization.k8s.io" in the namespace "kube-system"
│ 
│ 
╵
╷
│ Error: reading KMS Key (2bad14fa-6188-40bc-a39c-7ce04cff5c42): reading KMS Key (2bad14fa-6188-40bc-a39c-7ce04cff5c42): operation error KMS: DescribeKey, https response error StatusCode: 400, RequestID: a4ea3e5a-619a-4c84-bdec-4a826d7d1ebd, api error AccessDeniedException: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1750043206376655301 is not authorized to perform: kms:DescribeKey on resource: arn:aws:kms:eu-central-1:895976263444:key/2bad14fa-6188-40bc-a39c-7ce04cff5c42 because no resource-based policy allows the kms:DescribeKey action
│ 
│   with module.eks.module.eks.module.kms.aws_kms_key.this[0],
│   on .terraform/modules/eks.eks.kms/main.tf line 18, in resource "aws_kms_key" "this":
│   18: resource "aws_kms_key" "this" {
│ 
╵

```
</details>